{"data":{"site":{"siteMetadata":{"title":"Dulldave","author":"David Dyke"}},"markdownRemark":{"id":"f39e040a-e2af-5285-819e-f7a2fd0a1b36","excerpt":"I came across an incident recently where data was going to a service via SQS, upon hitting that service it would then talk to a bunch of other services to…","html":"<p>I came across an incident recently where data was going to a service via SQS, upon hitting that service it would then talk to a bunch of other services to gather more data for the request. At the same time an attack had taking down the connection to those other services which was causing our requests to fail and build up on a dead letter queue. Now these requests weren’t broken per se, they were just victim to a one off transient error. The data within the request was perfectly valid. Prior to this the dead letter queue was used more for logging the very occasional permanent error that had occured and was used as a way to debug.</p>\n<p>Because of that event I wanted to build something that could be turned on at a moments notice and be used to replay items in the dead letter queue, albeit temporarily.</p>\n<p>Lambda seemed to be a good fit for this. We could specify a queue to trigger the Lambda against and a queue to replay those items to. Which would mean if we got notified via our Cloudwatch alarms that the DLQ was filling up we could diagnose the issue and at the right time consume those items in the DLQ.</p>\n<p>The other benefit with using a Lambda is that we can have all of the code sitting, with the triggers disabled, and only when we need to enable them to start the process.</p>\n<p>Let’s start with a simple make file, we can use this to build and deploy our Lambda:</p>\n<div class=\"gatsby-highlight\" data-language=\"make\"><pre class=\"language-make\"><code class=\"language-make\">buildAndZip:\n\tGOOS=linux go build handler.go\n\tzip handler.zip ./handler\n\nclean:\n\trm handler.zip handler\n\ncreate:\n\tmake buildAndZip\n\n\taws lambda create-function \\\n\t\t--region eu-west-1 \\\n\t\t--function-name sqs-dead-letter-replay \\\n\t\t--memory 128 \\\n\t\t--role arn:aws:iam::&lt;ACCOUNT-ID&gt;:role/&lt;ROLE-NAME&gt; \\\n\t\t--runtime go1.x \\\n\t\t--zip-file fileb://handler.zip \\\n\t\t--handler handler\n\n\tmake clean\n\nupdate:\n\tmake buildAndZip\n\n\taws lambda update-function-code \\\n\t\t--function-name sqs-dead-letter-replay \\\n\t\t--zip-file fileb://handler.zip\n\n\tmake clean</code></pre></div>\n<ul>\n<li><code class=\"language-text\">buildAndZip</code> simply builds a Go binary for the targetted OS, in this case “linux” and then zips the outputted binary.</li>\n<li><code class=\"language-text\">clean</code> is just removes any created binary’s or zip files.</li>\n</ul>\n<p><a href=\"https://github.com/aws/aws-lambda-go/blob/master/events/README_SQS.md\">https://github.com/aws/aws-lambda-go/blob/master/events/README_SQS.md</a></p>","frontmatter":{"title":"AWS SQS Dead Letter Replay Lambda","date":"March 17, 2019","description":"Ever needed to replay items in your dead letter queue?"}}},"pageContext":{"slug":"/aws-sqs-dead-letter-replay-lambda/","previous":{"fields":{"slug":"/how-i-like-to-structure-and-build-go-services/"},"frontmatter":{"title":"How I like to Structure and Build Go Services"}},"next":null}}